In [4]:
%%sql 
select
 avg(56,69,73,86,99)

Traceback (most recent call last):
  File "/home/yz/anaconda3/envs/stable_env/lib/python3.10/site-packages/sql/magic.py", line 196, in execute
    conn = sql.connection.Connection.set(
  File "/home/yz/anaconda3/envs/stable_env/lib/python3.10/site-packages/sql/connection.py", line 82, in set
    raise ConnectionError(
sql.connection.ConnectionError: Environment variable $DATABASE_URL not set, and no connect string given.

Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys([])

In [2]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [2]:
%sql mysql+pymysql://root:passmeplease@localhost:3306/md_water_services

In [3]:
%%sql 
show tables;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
9 rows affected.

[('data_dictionary',),
 ('employee',),
 ('global_water_access',),
 ('location',),
 ('visits',),
 ('water_quality',),
 ('water_source',),
 ('well_pollution',),
 ('well_pollution_copy',)]

In [51]:
%%sql 
select 
*
from 
employee
limit 100 ;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
56 rows affected.

[(0, 'Amara Jengo', '+99637993287', 'amara.jengo@ndogowater.gov', '36 Pwani Mchangani Road', 'Sokoto', 'Ilanga', 'Field Surveyor'),
 (1, 'Bello Azibo', '+99643864786', 'bello.azibo@ndogowater.gov', '129 Ziwa La Kioo Road', 'Kilimani', 'Rural', 'Field Surveyor'),
 (2, 'Bakari Iniko', '+99222599041', 'bakari.iniko@ndogowater.gov', '18 Mlima Tazama Avenue', 'Hawassa', 'Rural', 'Field Surveyor'),
 (3, 'Malachi Mavuso', '+99945849900', 'malachi.mavuso@ndogowater.gov', '100 Mogadishu Road', 'Akatsi', 'Lusaka', 'Field Surveyor'),
 (4, 'Cheche Buhle', '+99381679640', 'cheche.buhle@ndogowater.gov', '1 Savanna Street', 'Akatsi', 'Rural', 'Field Surveyor'),
 (5, 'Zuriel Matembo', '+99034075111', 'zuriel.matembo@ndogowater.gov', '26 Bahari Ya Faraja Road', 'Kilimani', 'Rural', 'Field Surveyor'),
 (6, 'Deka Osumare', '+99379364631', 'deka.osumare@ndogowater.gov', '104 Kenyatta Street', 'Akatsi', 'Rural', 'Field Surveyor'),
 (7, 'Lalitha Kaburi', '+99681623240', 'lalitha.kaburi@ndogowater.gov', '145 Sungura Amanpour Road', 'Kilimani', 'Rural', 'Field Surveyor'),
 (8, 'Enitan Zuri', '+99248509202', 'enitan.zuri@ndogowater.gov', '117 Kampala Road', 'Hawassa', 'Zanzibar', 'Field Surveyor'),
 (10, 'Farai Nia', '+99570082739', 'farai.nia@ndogowater.gov', '33 Angélique Kidjo Avenue', 'Amanzi', 'Dahabu', 'Field Surveyor'),
 (12, 'Gamba Shani', '+99438283153', 'gamba.shani@ndogowater.gov', '38 Mlima Tazama Avenue', 'Hawassa', 'Rural', 'Field Surveyor'),
 (14, 'Harith Nyota', '+99917230124', 'harith.nyota@ndogowater.gov', '42 Malabo Drive', 'Kilimani', 'Rural', 'Field Surveyor'),
 (16, 'Isoke Amani', '+99313603182', 'isoke.amani@ndogowater.gov', '55 Fennec Way', 'Sokoto', 'Rural', 'Field Surveyor'),
 (18, 'Jengo Tumaini', '+99820596465', 'jengo.tumaini@ndogowater.gov', '17 Port Harcourt Boulevard', 'Akatsi', 'Kintampo', 'Field Surveyor'),
 (20, 'Kunto Asha', '+99176320477', 'kunto.asha@ndogowater.gov', '30 Nyoka Achebe Street', 'Amanzi', 'Dahabu', 'Field Surveyor'),
 (22, 'Lesedi Kofi', '+99611183730', 'lesedi.kofi@ndogowater.gov', '52 Moroni Avenue', 'Sokoto', 'Rural', 'Field Surveyor'),
 (24, 'Makena Thabo', '+99690308755', 'makena.thabo@ndogowater.gov', '81 Rhodes Street', 'Hawassa', 'Rural', 'Field Surveyor'),
 (26, 'Nia Furaha', '+99522694997', 'nia.furaha@ndogowater.gov', '51 Addis Ababa Road', 'Akatsi', 'Harare', 'Field Surveyor'),
 (28, 'Ona Sefu', '+99797494944', 'ona.sefu@ndogowater.gov', '67 Wimbi Dira Avenue', 'Akatsi', 'Harare', 'Field Surveyor'),
 (30, 'Pili Zola', '+99822478933', 'pili.zola@ndogowater.gov', '46 Stone Town Street', 'Hawassa', 'Zanzibar', 'Field Surveyor'),
 (32, 'Quibilah Akua', '+99533195846', 'quibilah.akua@ndogowater.gov', '77 Kinshasa Boulevard', 'Sokoto', 'Rural', 'Field Surveyor'),
 (34, 'Rudo Imani', '+99046972648', 'rudo.imani@ndogowater.gov', '15 Lake Malawi Avenue', 'Kilimani', 'Ilanga', 'Field Surveyor'),
 (36, 'Sanaa Tendaji', '+99477692836', 'sanaa.tendaji@ndogowater.gov', '88 Elephantine Boulevard', 'Amanzi', 'Dahabu', 'Field Surveyor'),
 (38, 'Thandiwe Kito', '+99895654233', 'thandiwe.kito@ndogowater.gov', '106 Dakar Road', 'Hawassa', 'Zanzibar', 'Field Surveyor'),
 (40, 'Usafi Ayo', '+99613194771', 'usafi.ayo@ndogowater.gov', '76 Kenyatta Street', 'Sokoto', 'Rural', 'Field Surveyor'),
 (42, 'Vuyisile Kwame', '+99489752164', 'vuyisile.kwame@ndogowater.gov', '1 Zambezi Way', 'Kilimani', 'Rural', 'Field Surveyor'),
 (44, 'Wambui Jabali', '+99269319001', 'wambui.jabali@ndogowater.gov', '31 Mandela Road', 'Hawassa', 'Rural', 'Field Surveyor'),
 (46, 'Xola Uzuri', '+99239172440', 'xola.uzuri@ndogowater.gov', '50 Enkare Narok Avenue', 'Amanzi', 'Dahabu', 'Field Surveyor'),
 (48, 'Yewande Ebele', '+99239164858', 'yewande.ebele@ndogowater.gov', '119 Moroni Avenue', 'Hawassa', 'Rural', 'Field Surveyor'),
 (49, 'Nadia Zalika', '+99578401238', 'nadia.zalika@ndogowater.gov', '26 Bahari Ya Faraja Road', 'Kilimani', 'Rural', 'Project Manager'),
 (50, 'Ayo Deka', '+99345162378', 'ayo.deka@ndogowater.gov', '18 Mlima Tazama Avenue', 'Hawassa', 'Rural', 'UI/UX Designer'),
 (52, 'Bahira Jamila', '+99239271483', 'bahira.jamila@ndogowater.gov', '30 Nyoka Achebe Street', 'Amanzi', 'Dahabu', 'Front-end Developer'),
 (53, 'Chidi Kunto', '+99738251476', 'chidi.kunto@ndogowater.gov', '146 Okapi Road', 'Hawassa', 'Yaounde', 'Data Analyst'),
 (54, 'Dalila Lesedi', '+99471523698', 'dalila.lesedi@ndogowater.gov', '18 Casablanca Road', 'Sokoto', 'Rural', 'Data Analyst'),
 (56, 'Eshe Makena', '+99381254763', 'eshe.makena@ndogowater.gov', '45 Umqombothi Avenue', 'Hawassa', 'Serowe', 'Human Resources Specialist'),
 (58, 'Faridah Khalida', '+99142537684', 'faridah.khalida@ndogowater.gov', '176 Port Said Street', 'Kilimani', 'Harare', 'Pioneer'),
 (62, 'Gavivi Ona', '+99924513876', 'gavivi.ona@ndogowater.gov', '51 Addis Ababa Road', 'Akatsi', 'Harare', 'Financial Analyst'),
 (64, 'Hasani Pili', '+99568247135', 'hasani.pili@ndogowater.gov', '33 Afro Beat Road', 'Hawassa', 'Serowe', 'Deputy Project Manager'),
 (68, 'Iniko Quibilah', '+99735681472', 'iniko.quibilah@ndogowater.gov', '93 Afro Beat Road', 'Hawassa', 'Serowe', 'Financial Manager'),
 (71, 'Jengo Rudo', '+99317854629', 'jengo.rudo@ndogowater.gov', '33 Angélique Kidjo Avenue', 'Amanzi', 'Dahabu', 'Civil Engineer'),
 (73, 'Kofi Sanaa', '+99874512369', 'kofi.sanaa@ndogowater.gov', '42 Malabo Drive', 'Kilimani', 'Rural', 'Creative Designer'),
 (75, 'Lulu Thandiwe', '+99127436598', 'lulu.thandiwe@ndogowater.gov', '117 Kampala Road', 'Hawassa', 'Zanzibar', 'Team Leader'),
 (79, 'Makena Usafi', '+99583124796', 'makena.usafi@ndogowater.gov', '55 Fennec Way', 'Sokoto', 'Rural', 'Quality Assurance Analyst'),
 (81, 'Nia Vuyisile', '+99273841596', 'nia.vuyisile@ndogowater.gov', '52 Moroni Avenue', 'Sokoto', 'Rural', 'Civil Engineer'),
 (83, 'Ona Wambui', '+99968217435', 'ona.wambui@ndogowater.gov', '81 Rhodes Street', 'Hawassa', 'Rural', 'Public Relations Specialist'),
 (87, 'Pili Xola', '+99682314579', 'pili.xola@ndogowater.gov', '31 Samora Machel Road', 'Kilimani', 'Harare', 'Civil Engineer'),
 (89, 'Quibilah Yewande', '+99721534698', 'quibilah.yewande@ndogowater.gov', '110 Nyerere Road', 'Kilimani', 'Rural', 'Supervisor'),
 (93, 'Rudo Zalika', '+99578123469', 'rudo.zalika@ndogowater.gov', '7 Dakar Drive', 'Akatsi', 'Lusaka', 'Field Engineer'),
 (94, 'Sanaa Ayo', '+99375418692', 'sanaa.ayo@ndogowater.gov', '172 Fisi Nkrumah Street', 'Akatsi', 'Rural', 'Data Scientist'),
 (96, 'Thabo Akida', '+99178325649', 'thabo.akida@ndogowater.gov', '24 Okonjo-Iweala Street', 'Akatsi', 'Lusaka', 'Engineering Department Head'),
 (98, 'Usafi Bahir', '+99234156789', 'usafi.bahir@ndogowater.gov', '1 Savanna Street', 'Akatsi', 'Rural', 'Analytical Chemist'),
 (102, 'Vuyisile Ghadir', '+99712584936', 'vuyisile.ghadir@ndogowater.gov', '104 Kenyatta Street', 'Akatsi', 'Rural', 'Micro Biologist'),
 (104, 'Wambui Hadiya', '+99634157892', 'wambui.hadiya@ndogowater.gov', '145 Sungura Amanpour Road', 'Kilimani', 'Rural', 'Compliance Officer'),
 (105, 'Xola Inaya', '+99231569847', 'xola.inaya@ndogowater.gov', '100 Mogadishu Road', 'Akatsi', 'Lusaka', 'Field Engineer'),
 (108, 'Yewande Jengo', '+99123456978', 'yewande.jengo@ndogowater.gov', '25 Selassie Drive', 'Amanzi', 'Rural', 'Construction Manager'),
 (110, 'Zuri Kofi', '+99412356789', 'zuri.kofi@ndogowater.gov', '36 Pwani Mchangani Road', 'Sokoto', 'Ilanga', 'Graphic Designer')]

In [21]:
%%sql 
select 
replace(employee_name , ' ','.')
from 
employee 
limit 10;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
10 rows affected.

[('Amara.Jengo',),
 ('Bello.Azibo',),
 ('Bakari.Iniko',),
 ('Malachi.Mavuso',),
 ('Cheche.Buhle',),
 ('Zuriel.Matembo',),
 ('Deka.Osumare',),
 ('Lalitha.Kaburi',),
 ('Enitan.Zuri',),
 ('Farai.Nia',)]

In [44]:
%%sql 
select 
lower(replace(employee_name , ' ','.'))
from 
employee 
limit 10;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
10 rows affected.

[('amara.jengo',),
 ('bello.azibo',),
 ('bakari.iniko',),
 ('malachi.mavuso',),
 ('cheche.buhle',),
 ('zuriel.matembo',),
 ('deka.osumare',),
 ('lalitha.kaburi',),
 ('enitan.zuri',),
 ('farai.nia',)]

In [24]:
%%sql 
select 
concat(lower(replace(employee_name , ' ','.')),'@ndogowater.gov')
from 
employee 
limit 10;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
10 rows affected.

[('amara.jengo@ndogowater.gov',),
 ('bello.azibo@ndogowater.gov',),
 ('bakari.iniko@ndogowater.gov',),
 ('malachi.mavuso@ndogowater.gov',),
 ('cheche.buhle@ndogowater.gov',),
 ('zuriel.matembo@ndogowater.gov',),
 ('deka.osumare@ndogowater.gov',),
 ('lalitha.kaburi@ndogowater.gov',),
 ('enitan.zuri@ndogowater.gov',),
 ('farai.nia@ndogowater.gov',)]

In [26]:
%%sql
 update employee
set email = concat(lower(replace(employee_name , ' ','.')),'@ndogowater.gov');

 * mysql+pymysql://root:***@localhost:3306/md_water_services
56 rows affected.

[]

In [42]:
%%sql 
select 
 length( phone_number)
from 
employee ;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
56 rows affected.

[(13,),
 (13,),
 (13,),
 (13,),
 (13,),
 (13,),
 (13,),
 (13,),
 (13,),
 (13,),
 (13,),
 (13,),
 (13,),
 (13,),
 (13,),
 (13,),
 (13,),
 (13,),
 (13,),
 (13,),
 (13,),
 (13,),
 (13,),
 (13,),
 (13,),
 (13,),
 (13,),
 (13,),
 (13,),
 (13,),
 (13,),
 (13,),
 (13,),
 (13,),
 (13,),
 (13,),
 (13,),
 (13,),
 (13,),
 (13,),
 (13,),
 (13,),
 (13,),
 (13,),
 (13,),
 (13,),
 (13,),
 (13,),
 (13,),
 (13,),
 (13,),
 (13,),
 (13,),
 (13,),
 (13,),
 (13,)]

In [47]:
%%sql 
select 
 length (phone_number)
from 
employee ;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
56 rows affected.

[(12,),
 (12,),
 (12,),
 (12,),
 (12,),
 (12,),
 (12,),
 (12,),
 (12,),
 (12,),
 (12,),
 (12,),
 (12,),
 (12,),
 (12,),
 (12,),
 (12,),
 (12,),
 (12,),
 (12,),
 (12,),
 (12,),
 (12,),
 (12,),
 (12,),
 (12,),
 (12,),
 (12,),
 (12,),
 (12,),
 (12,),
 (12,),
 (12,),
 (12,),
 (12,),
 (12,),
 (12,),
 (12,),
 (12,),
 (12,),
 (12,),
 (12,),
 (12,),
 (12,),
 (12,),
 (12,),
 (12,),
 (12,),
 (12,),
 (12,),
 (12,),
 (12,),
 (12,),
 (12,),
 (12,),
 (12,)]

In [46]:
%%sql 
update employee
 set phone_number = RTRIM(phone_number);

 * mysql+pymysql://root:***@localhost:3306/md_water_services
56 rows affected.

[]

In [54]:
%%sql 
select 
 *
from
 employee
limit 3;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
3 rows affected.

[(0, 'Amara Jengo', '+99637993287', 'amara.jengo@ndogowater.gov', '36 Pwani Mchangani Road', 'Sokoto', 'Ilanga', 'Field Surveyor'),
 (1, 'Bello Azibo', '+99643864786', 'bello.azibo@ndogowater.gov', '129 Ziwa La Kioo Road', 'Kilimani', 'Rural', 'Field Surveyor'),
 (2, 'Bakari Iniko', '+99222599041', 'bakari.iniko@ndogowater.gov', '18 Mlima Tazama Avenue', 'Hawassa', 'Rural', 'Field Surveyor')]

Use the employee table to count how many of our employees live in each town. Think carefully about what function we should use and how we
should aggregate the data.

In [ ]:
%%sql 
SELECT
    town_name,
    COUNT(employee_name) AS num_employees
FROM
    employee
GROUP BY
    town_name 
order by town_name;

Let's first look at the number of records each employee collected. So find the correct table, figure out what function to use and how to group, order
and limit the results to only see the top 3 employee_ids with the highest number of locations visited.

In [23]:
%%sql
select
assigned_employee_id ,
 count(*) as number_of_visits
from 
visits 
group by assigned_employee_id
order by assigned_employee_id
limit 3 ;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
3 rows affected.

[(0, 1099), (1, 3708), (2, 2033)]

Make a note of the top 3 assigned_employee_id and use them to create a query that looks up the employee's info. Since you're a pro at finding
stuff in a database now, you can figure this one out. You should have a column of names, email addresses and phone numbers for our top dogs.

In [29]:
%%sql
select 
assigned_employee_id,
employee_name,
phone_number,
email
from 
employee
where assigned_employee_id in (0,1,2) ;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
3 rows affected.

[(0, 'Amara Jengo', '+99637993287', 'amara.jengo@ndogowater.gov'),
 (1, 'Bello Azibo', '+99643864786', 'bello.azibo@ndogowater.gov'),
 (2, 'Bakari Iniko', '+99222599041', 'bakari.iniko@ndogowater.gov')]

In [35]:
%%sql 
select 
*
from 
location
group by town_name
limit 5;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('AmAb08940', '17 Atlas Mountain Crest', 'Amanzi', 'Abidjan', 'Urban'),
 ('KiAm21920', '3 Zanzibar Crossing', 'Kilimani', 'Amara', 'Urban'),
 ('AmAm09340', '41 Zambezi Way', 'Amanzi', 'Amina', 'Urban'),
 ('AmAs10010', '83 Tembo Road', 'Amanzi', 'Asmara', 'Urban'),
 ('SoBa31430', '29 Stanley Avenue', 'Sokoto', 'Bahari', 'Urban')]

Create a query that counts the number of records per town

In [44]:
%%sql 
select 
town_name ,
count(town_name) as records_per_town
from 
location
group by town_name
order by records_per_town DESC
limit 6;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
6 rows affected.

[('Rural', 23740),
 ('Harare', 1650),
 ('Amina', 1090),
 ('Lusaka', 1070),
 ('Mrembo', 990),
 ('Asmara', 930)]

Now count the records per province.

In [4]:
%%sql 
select 
province_name ,
count(town_name) as records_per_province
from 
location
group by province_name
order by records_per_town DESC
limit 6;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('Kilimani', 9510),
 ('Akatsi', 8940),
 ('Sokoto', 8220),
 ('Amanzi', 6950),
 ('Hawassa', 6030)]

Can you find a way to do the following:
1. Create a result set showing:
• province_name
• town_name
• An aggregated count of records for each town (consider naming this records_per_town).
• Ensure your data is grouped by both province_name and town_name.
2. Order your results primarily by province_name. Within each province, further sort the towns by their record counts in descending order.

In [22]:
%%sql 
select 
province_name ,
town_name,
count(town_name) as records_per_town
from 
location
group by province_name,town_name
order by province_name asc , records_per_town DESC
limit 6;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
6 rows affected.

[('Akatsi', 'Rural', 6290),
 ('Akatsi', 'Lusaka', 1070),
 ('Akatsi', 'Harare', 800),
 ('Akatsi', 'Kintampo', 780),
 ('Amanzi', 'Rural', 3100),
 ('Amanzi', 'Asmara', 930)]

Finally, look at the number of records for each location type

In [27]:
%%sql 
select 
location_type ,
count(town_name) as num_sources
from 
location
group by location_type
order by town_name

limit 2;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
2 rows affected.

[('Urban', 15910), ('Rural', 23740)]

In [28]:
%%sql
SELECT 23740 / (15910 + 23740) * 100

 * mysql+pymysql://root:***@localhost:3306/md_water_services
1 rows affected.

[(Decimal('59.8739'),)]

In [34]:
%%sql 
 select 
*
 from 
water_source 
limit 10;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
10 rows affected.

[('AkHa00000224', 'tap_in_home', 956),
 ('AkHa00001224', 'tap_in_home_broken', 930),
 ('AkHa00002224', 'tap_in_home_broken', 486),
 ('AkHa00003224', 'well', 364),
 ('AkHa00004224', 'tap_in_home_broken', 942),
 ('AkHa00005224', 'tap_in_home', 736),
 ('AkHa00006224', 'tap_in_home', 882),
 ('AkHa00007224', 'tap_in_home', 554),
 ('AkHa00008224', 'well', 398),
 ('AkHa00009224', 'well', 346)]

In [41]:
%%sql 
 select 
type_of_water_source ,
count(type_of_water_source)
 from 
water_source 
group by type_of_water_source
order by source_id
limit 2;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
2 rows affected.

[('tap_in_home', 7265), ('tap_in_home_broken', 5856)]

Ok next up, question 3: What is the average number of people that are served by each water source? Remember to make the numbers easy to
read.

In [13]:
%%sql 
select 
type_of_water_source,
round(avg(number_of_people_served),0) as ave_people_per_source
from 
water_source
group by type_of_water_source
order by source_id

;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('tap_in_home', Decimal('644')),
 ('tap_in_home_broken', Decimal('649')),
 ('well', Decimal('279')),
 ('shared_tap', Decimal('2071')),
 ('river', Decimal('699'))]

In [15]:
%%sql 
select 
644 / 6

 * mysql+pymysql://root:***@localhost:3306/md_water_services
1 rows affected.

[(Decimal('107.3333'),)]

In [7]:
%%sql 
select 
type_of_water_source,
sum(number_of_people_served) as ave_people_per_source
from 
water_source
group by type_of_water_source
order by ave_people_per_source desc
;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('shared_tap', Decimal('11945272')),
 ('well', Decimal('4841724')),
 ('tap_in_home', Decimal('4678880')),
 ('tap_in_home_broken', Decimal('3799720')),
 ('river', Decimal('2362544'))]

Next, calculate the percentages using the total we just got.

In [22]:
%%sql 
select 
type_of_water_source,
(sum(number_of_people_served)/27628140) * 100 as ave_people_per_source
from 
water_source
group by type_of_water_source
order by ave_people_per_source desc
;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('shared_tap', Decimal('43.2359')),
 ('well', Decimal('17.5246')),
 ('tap_in_home', Decimal('16.9352')),
 ('tap_in_home_broken', Decimal('13.7531')),
 ('river', Decimal('8.5512'))]

Let's round that off to 0 decimals, and order the results.

In [26]:
%%sql 
select 
type_of_water_source,
round(sum(number_of_people_served)/27628140 * 100,0) as ave_people_per_source
from 
water_source
group by type_of_water_source
order by ave_people_per_source desc
;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('shared_tap', Decimal('43')),
 ('well', Decimal('18')),
 ('tap_in_home', Decimal('17')),
 ('tap_in_home_broken', Decimal('14')),
 ('river', Decimal('9'))]

So use a window function on the total people served column, converting it into a rank.

In [46]:
%%sql
SELECT
    type_of_water_source,
    percent_of_total,
    -- Apply the RANK() function to the calculated percentage
    RANK() OVER (ORDER BY percent_of_total DESC) AS source_rank
FROM (
    SELECT
        type_of_water_source,
        -- Calculate the percentage of total population served
        SUM(number_of_people_served)  AS percent_of_total
    FROM
        water_source
    GROUP BY
        type_of_water_source
) AS SourceData
ORDER BY
    source_rank ASC;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('shared_tap', Decimal('11945272'), 1),
 ('well', Decimal('4841724'), 2),
 ('tap_in_home', Decimal('4678880'), 3),
 ('tap_in_home_broken', Decimal('3799720'), 4),
 ('river', Decimal('2362544'), 5)]

So create a query to do this, and keep these requirements in mind:
1. The sources within each type should be assigned a rank.
2. Limit the results to only improvable sources.
3. Think about how to partition, filter and order the results set.
4. Order the results to see the top of the list.

In [11]:
%%sql
SELECT
    source_id,
    type_of_water_source,
    number_of_people_served,
    -- Ranks sources within their type (PARTITION BY)
    RANK() OVER (
        PARTITION BY type_of_water_source
        ORDER BY number_of_people_served DESC
    ) AS priority_rank
FROM
    water_source 
 order by  priority_rank asc ,
number_of_people_served desc
limit 10;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
10 rows affected.

[('AkRu05603224', 'shared_tap', 3998, 1),
 ('HaRu19509224', 'shared_tap', 3998, 1),
 ('AkKi00930224', 'tap_in_home', 998, 1),
 ('AkLu02378224', 'tap_in_home', 998, 1),
 ('AkRu04138224', 'tap_in_home', 998, 1),
 ('AkRu04822224', 'tap_in_home', 998, 1),
 ('AkRu06783224', 'tap_in_home', 998, 1),
 ('AmAb09192224', 'tap_in_home_broken', 998, 1),
 ('AmAm09750224', 'tap_in_home_broken', 998, 1),
 ('AmAm09926224', 'tap_in_home_broken', 998, 1)]

Try the different ranking functions in queries. Imagine yourself in an engineer's boots, and try to interpret the priority list. Thinking about the user
of a table helps us to design the table better.
In that line of thought, would it make sense to give them a list of source_ids? How would they know where to go?

In [4]:
%%sql
SELECT
    source_id,
    type_of_water_source,
    number_of_people_served,
 ROW_NUMBER() OVER (
        PARTITION BY type_of_water_source
        ORDER BY number_of_people_served DESC
    ) AS priority_rank
FROM
    water_source 
 order by  priority_rank asc ,
number_of_people_served desc
limit 10;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
10 rows affected.

[('AkRu05603224', 'shared_tap', 3998, 1),
 ('AkKi00930224', 'tap_in_home', 998, 1),
 ('AmAb09192224', 'tap_in_home_broken', 998, 1),
 ('KiMr25030224', 'river', 998, 1),
 ('AkHa00008224', 'well', 398, 1),
 ('HaRu19509224', 'shared_tap', 3998, 2),
 ('AkLu02378224', 'tap_in_home', 998, 2),
 ('AmAm09750224', 'tap_in_home_broken', 998, 2),
 ('KiRu28591224', 'river', 998, 2),
 ('AkHa00172224', 'well', 398, 2)]

Question 1:
To calculate how long the survey took, we need to get the first and last dates (which functions can find the largest/smallest value), and subtract
them. Remember with DateTime data, we can't just subtract the values. We have to use a function to get the difference in days.

In [12]:
%%sql
select 
datediff(max(time_of_record),min(time_of_record)) as differ
from 
visits;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
1 rows affected.

[(924,)]

Question 2:
Let's see how long people have to queue on average in Maji Ndogo. Keep in mind that many sources like taps_in_home have no queues. These
are just recorded as 0 in the time_in_queue column, so when we calculate averages, we need to exclude those rows. Try using NULLIF() do to
this.

In [16]:
%%sql 
select 
round(avg(nullif(time_in_queue,0))) as avg
from 
visits;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
1 rows affected.

[(Decimal('123'),)]

Question 3:
So let's look at the queue times aggregated across the different days of the week.

In [22]:
%%sql
select 
dayname(time_of_record) as day_of_the_week,
round(avg(nullif(time_in_queue,0))) as avg_queue_time
from 
visits 
group by day_of_the_week
order by  time_of_record
;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
7 rows affected.

[('Friday', Decimal('120')),
 ('Saturday', Decimal('246')),
 ('Sunday', Decimal('82')),
 ('Monday', Decimal('137')),
 ('Tuesday', Decimal('108')),
 ('Wednesday', Decimal('97')),
 ('Thursday', Decimal('105'))]

In [ ]:
Question 4:
We can also look at what time during the day people collect water. Try to order the results in a meaningful way.

In [20]:
%%sql
select 
hour(time_of_record) as hour_of_day,
round(avg(nullif(time_in_queue,0))) as avg_queue_time
from 
visits 
group by hour_of_day 
order by  hour_of_day asc
limit 5;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[(6, Decimal('149')),
 (7, Decimal('149')),
 (8, Decimal('149')),
 (9, Decimal('118')),
 (10, Decimal('114'))]

In [24]:
%%sql
select 
TIME_FORMAT(TIME(time_of_record), '%H:00') AS hour_of_day,
round(avg(nullif(time_in_queue,0))) as avg_queue_time
from 
visits 
group by hour_of_day 
order by  hour_of_day asc
limit 5;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('06:00', Decimal('149')),
 ('07:00', Decimal('149')),
 ('08:00', Decimal('149')),
 ('09:00', Decimal('118')),
 ('10:00', Decimal('114'))]

In [31]:
%%sql
SELECT
TIME_FORMAT(TIME(time_of_record), '%H:00') AS hour_of_day,
-- Sunday
ROUND(AVG(
CASE
WHEN DAYNAME(time_of_record) = 'Sunday' THEN time_in_queue
ELSE NULL
END
),0) AS Sunday,
-- Monday
ROUND(AVG(
CASE
WHEN DAYNAME(time_of_record) = 'Monday' THEN time_in_queue
ELSE NULL
END
),0) AS Monday,
-- Tuesday
ROUND(AVG(
CASE
WHEN DAYNAME(time_of_record) = 'Tuesday' THEN time_in_queue
ELSE NULL
END
),0) AS Tuesday,
-- Wednesday
ROUND(AVG(
CASE
WHEN DAYNAME(time_of_record) = 'Wednesday' THEN time_in_queue
ELSE NULL
END
),0) AS Wednesday,
ROUND(AVG(
CASE
WHEN DAYNAME(time_of_record) = 'Monday' THEN time_in_queue
ELSE NULL
END
),0) AS Monday,
ROUND(AVG(
CASE
WHEN DAYNAME(time_of_record) = 'Thursday' THEN time_in_queue
ELSE NULL
END
),0) AS Thursday,
ROUND(AVG(
CASE
WHEN DAYNAME(time_of_record) = 'Friday' THEN time_in_queue
ELSE NULL
END
),0) AS Friday,
ROUND(AVG(
CASE
WHEN DAYNAME(time_of_record) = 'Saturday' THEN time_in_queue
ELSE NULL
END
),0) AS Saturday
FROM
visits
WHERE
time_in_queue != 0 -- this excludes other sources with 0 queue times
GROUP BY
hour_of_day
ORDER BY
hour_of_day
limit 8;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
8 rows affected.

[('06:00', Decimal('79'), Decimal('190'), Decimal('134'), Decimal('112'), Decimal('190'), Decimal('134'), Decimal('153'), Decimal('247')),
 ('07:00', Decimal('82'), Decimal('186'), Decimal('128'), Decimal('111'), Decimal('186'), Decimal('139'), Decimal('156'), Decimal('247')),
 ('08:00', Decimal('86'), Decimal('183'), Decimal('130'), Decimal('119'), Decimal('183'), Decimal('129'), Decimal('153'), Decimal('247')),
 ('09:00', Decimal('84'), Decimal('127'), Decimal('105'), Decimal('94'), Decimal('127'), Decimal('99'), Decimal('107'), Decimal('252')),
 ('10:00', Decimal('83'), Decimal('119'), Decimal('99'), Decimal('89'), Decimal('119'), Decimal('95'), Decimal('112'), Decimal('259')),
 ('11:00', Decimal('78'), Decimal('115'), Decimal('102'), Decimal('86'), Decimal('115'), Decimal('99'), Decimal('104'), Decimal('236')),
 ('12:00', Decimal('78'), Decimal('115'), Decimal('97'), Decimal('88'), Decimal('115'), Decimal('96'), Decimal('109'), Decimal('239')),
 ('13:00', Decimal('81'), Decimal('122'), Decimal('97'), Decimal('98'), Decimal('122'), Decimal('101'), Decimal('115'), Decimal('242'))]